#!/bin/bash

# ============================================================
#  Лабораторная работа №3
#  Сценарий: сборка модуля управления процессами
# ============================================================

# ================== визуальный профиль ==================
C_FLOW="\033[38;5;39m"     # основной поток
C_OK="\033[38;5;82m"       # успех
C_WARN="\033[38;5;214m"    # предупреждение
C_ERR="\033[38;5;196m"     # ошибка
C_DIM="\033[2m"            # вторичный текст
C_RESET="\033[0m"

flow() { printf "%b\n" "${C_FLOW}$1${C_RESET}"; }
ok()   { printf "%b\n" "${C_OK}$1${C_RESET}"; }
warn() { printf "%b\n" "${C_WARN}$1${C_RESET}"; }
err()  { printf "%b\n" "${C_ERR}$1${C_RESET}"; }

# ================== окружение ==================
ROOT_DIR="$(cd "$(dirname "$0")/.." && pwd)"
BUILD_DIR="${ROOT_DIR}/build"

# ================== фаза инициализации ==================
flow ">> Инициилизируем рабочее окружение"

if [ ! -d "$BUILD_DIR" ]; then
  mkdir -p "$BUILD_DIR"
  warn ">> Рабочее окружение создано"
else
  flow ">> Рабочее окружение обнаружено"
fi

cd "$BUILD_DIR" || {
  err ">> Ошибка во время создания рабочего окружения"
  warn "Нажмите enter, чтобы выйти..."
  read -r
  exit 1
}

ok ">> Успешно перешли в рабочий каталог"

# ================== конфигурация ==================
flow ">> Конфигурация проекта (CMake)"
cmake ..

if [ $? -ne 0 ]; then
    err "Ошибка на этапе конфигурации CMake"
    warn "Нажмите enter, чтобы выйти..."
    read -r 
    exit 1
else
    ok "Конфигурация завершена успешно!"
fi


# ================== сборка ==================
flow ">> Сборка проекта"
cmake --build .
if [ $? -ne 0 ]; then
    err "Ошибка на этапе сборки"
    warn "Нажмите enter, чтобы выйти..."
    read -r 
    exit 1
fi
ok "Сборка проекта завершена"

# ================== итог ==================

printf "\n"
flow "Расположение исполняемого файла:"
printf "%b\n" "${C_DIM}  build/bin/os_lab3_main${C_RESET}"

printf "\n"
flow "Пример запуска:"
printf "%b\n" "${C_DIM}  cd build/bin${C_RESET}"
printf "%b\n" "${C_DIM}  ./os_lab3_main${C_RESET}"

printf "\n"
flow "Запуск нескольких экземпляров:"
printf "%b\n" "${C_DIM}  ./os_lab3_main&${C_RESET}"
printf "%b\n" "${C_DIM}  ./os_lab3_main&${C_RESET}"

printf "\n"
flow "Файл логов:"
printf "%b\n" "${C_DIM}  build/bin/logs/process.log${C_RESET}"

printf "\n"

# -------- интерактивный запуск --------
read -r -p "Хотите запустить тестовый скрипт? [Д/н]: " answer

flow "Запускаю тестовый скрипт..."
case "$answer" in
  ""|[ДдYy])
    ./bin/os_lab3_main; read -p "Нажмите Enter для выхода..."
    ;;
  [НнNn])
    exit 0
    ;;
  *)
    err "Некорректный ввод, завершение программы"
    warn "Нажмите enter, чтобы выйти..."
    read -r 
    exit 1
    ;;
esac
